app/Controllers/AdminController.php

    public function index()
    {#function atau method untuk menampilkan jumlah user kategori wirausaha
        $infos = new UserModel();
        $infos->select('*');
        $infos->like('status', 'Wirausaha');
        $WIRAUSAHA = $infos->countAllResults('tbl_users');

#function atau method untuk menampilkan jumlah user kategori LAINNYA
        $in = new UserModel();
        $in->select('*');
        $in->like('status', 'Lain');
        $LAIN = $in->countAllResults('tbl_users');

#function atau method untuk menampilkan jumlah user kategori belajar
        $info = new UserModel();
        $info->select('*');
        $info->like('status', 'Belajar');
        $BELAJAR = $info->countAllResults('tbl_users');

        #function atau method untuk menampilkan jumlah user kategori  bekerja
        $ii = new UserModel();
        $ii->select('*');
        $ii->like('status', 'Bekerja');
        $BEKERJA = $ii->countAllResults('tbl_users');
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`
WHERE `status` LIKE '%Wirausaha%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`
WHERE `status` LIKE '%Lain%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`
WHERE `status` LIKE '%Belajar%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`
WHERE `status` LIKE '%Bekerja%' ESCAPE '!'

  public function user_Bekerja()
  {#function atau method untuk masuk kedalam user yang berstatus belajar
        $inf = new UserModel();
        $inf->select('*');
        $inf->like('status', 'Bekerja');
        $Vbekerja = $inf->get()->getResultArray();
---
SELECT *
FROM `tbl_users`
WHERE `status` LIKE '%Bekerja%' ESCAPE '!'

          public function ListSemua()
          {#function atau method untuk menampilkan semua user
              $info = new UserModel();
              $data = [
                  'tittle' => 'halaman Admin',
                  'des' => $info->findAll(15, 1),
---
SELECT *
FROM `tbl_users`
 LIMIT 1, 15

          public function HasilKuesioner()
          {
        $hasil = new Hasil();
 $kuis = new KuisBelajarModel();

        $data = [
            // rowdata
            // numRows
            // currentRow

          'h1_sangat_baik' => $hasil->select('hasil1')->where('hasil1', 'sangat baik')->get()->getNumRows(),
            'h1_baik' => $hasil->select('hasil1')->where('hasil1', 'baik')->get()->getNumRows(),
            'h1_cukup' => $hasil->select('hasil1')->where('hasil1', 'cukup')->get()->getNumRows(),
            'h1_kurang' => $hasil->select('hasil1')->where('hasil1', 'kurang')->get()->getNumRows(),

            'h2_sangat_baik' => $hasil->select('hasil2')->where('hasil2', 'sangat baik')->get()->getNumRows(),
              'h2_baik' => $hasil->select('hasil2')->where('hasil2', 'baik')->get()->getNumRows(),
              'h2_cukup' => $hasil->select('hasil2')->where('hasil2', 'cukup')->get()->getNumRows(),
              'h2_kurang' => $hasil->select('hasil2')->where('hasil2', 'kurang')->get()->getNumRows(),

              'h3_sangat_baik' => $hasil->select('hasil3')->where('hasil3', 'sangat baik')->get()->getNumRows(),
                'h3_baik' => $hasil->select('hasil3')->where('hasil3', 'baik')->get()->getNumRows(),
                'h3_cukup' => $hasil->select('hasil3')->where('hasil3', 'cukup')->get()->getNumRows(),
                'h3_kurang' => $hasil->select('hasil3')->where('hasil3', 'kurang')->get()->getNumRows(),

                'h4_sangat_baik' => $hasil->select('hasil4')->where('hasil4', 'sangat baik')->get()->getNumRows(),
                  'h4_baik' => $hasil->select('hasil4')->where('hasil4', 'baik')->get()->getNumRows(),
                  'h4_cukup' => $hasil->select('hasil4')->where('hasil4', 'cukup')->get()->getNumRows(),
                  'h4_kurang' => $hasil->select('hasil4')->where('hasil4', 'kurang')->get()->getNumRows(),

                  'h5_sangat_baik' => $hasil->select('hasil5')->where('hasil5', 'sangat baik')->get()->getNumRows(),
---
SELECT `hasil1`
FROM `hasil`
WHERE `hasil1` = 'sangat baik'
SELECT `hasil1`
FROM `hasil`
WHERE `hasil1` = 'baik'
SELECT `hasil1`
FROM `hasil`
WHERE `hasil1` = 'cukup'
SELECT `hasil1`
FROM `hasil`
WHERE `hasil1` = 'kurang'
SELECT `hasil2`
FROM `hasil`
WHERE `hasil2` = 'sangat baik'
SELECT `hasil2`
FROM `hasil`
WHERE `hasil2` = 'baik'
SELECT `hasil2`
FROM `hasil`
WHERE `hasil2` = 'cukup'
SELECT `hasil2`
FROM `hasil`
WHERE `hasil2` = 'kurang'
SELECT `hasil3`
FROM `hasil`
WHERE `hasil3` = 'sangat baik'
SELECT `hasil3`
FROM `hasil`
WHERE `hasil3` = 'baik'
SELECT `hasil3`
FROM `hasil`
WHERE `hasil3` = 'cukup'
SELECT `hasil3`
FROM `hasil`
WHERE `hasil3` = 'kurang'
SELECT `hasil4`
FROM `hasil`
WHERE `hasil4` = 'sangat baik'
SELECT `hasil4`
FROM `hasil`
WHERE `hasil4` = 'baik'
SELECT `hasil4`
FROM `hasil`
WHERE `hasil4` = 'cukup'
SELECT `hasil4`
FROM `hasil`
WHERE `hasil4` = 'kurang'
SELECT `hasil5`
FROM `hasil`
WHERE `hasil5` = 'sangat baik'